In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
s1 = Series([5,np.nan, 6, np.nan], index=list('ABCD'))
print(s1)

A    5.0
B    NaN
C    6.0
D    NaN
dtype: float64

In [4]:
s2 = Series(np.arange(4), index=list('ABCD'))
print(s2)

A    0
B    1
C    2
D    3
dtype: int64

In [5]:
s3 = Series(np.where(pd.isnull(s1),s2,s1), index=s1.index)
print(s3)

A    5.0
B    1.0
C    6.0
D    3.0
dtype: float64

In [6]:
s4 = s1.combine_first(s2)
print(s4)

A    5.0
B    1.0
C    6.0
D    3.0
dtype: float64

In [7]:
#Combinig 2 DataFrames -combine first()
df1 = DataFrame(
{'col1':[5, np.nan,15],
 'col2':[20,25,np.nan],
 'col3':[np.nan,np.nan,25]
}
)
print(df1)

   col1  col2  col3
0   5.0  20.0   NaN
1   NaN  25.0   NaN
2  15.0   NaN  25.0

In [9]:
df2 = DataFrame(
{'col1':[10,20,30],
 'col2':[30,40,50]
}
)
print(df2)

   col1  col2
0    10    30
1    20    40
2    30    50

In [10]:
df1.combine_first(df2)

   col1  col2  col3
0   5.0  20.0   NaN
1  20.0  25.0   NaN
2  15.0  50.0  25.0